ezois_ka/oooezoiskaobmen/src/Documents/ЗаявкаСоциальноеПособиеКабинетСотрудника/ЗаявкаСоциальноеПособиеКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаСоциальноеПособиеКабинетСотрудника</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлектронногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтменяемойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтменяемогоЭлектронногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИсправления</name>
    <type>
      <types>EnumRef.ВариантыИсправленияЗаявокКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменяемаяЗаявка</name>
    <type>
      <types>DefinedType.ЗаявкаКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыОбъектовИнтеграцияУправлениеПерсоналом</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипыЗаявокКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветПоЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛисткаНетрудоспособности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРожденияРебенка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРебенка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСотрудника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.РезультатыВыполненияЗаявокКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыПоЗаявке</name>
    <attributes>
      <name>ДокументСсылка</name>
      <type>
        <types>DefinedType.ДокументСоциальноеПособиеКабинетСотрудника</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Enums/ТипыЗаявокКабинетСотрудника/ТипыЗаявокКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаявокКабинетСотрудника</name>
  <enumValues>
    <name>СправкаНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаУдержаниеДСВ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>СправкаОбОстаткеОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаНалоговыеВычеты</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОтсутствия</name>
  </enumValues>
  <enumValues>
    <name>ОбращениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>УчебныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОпозданиеЛичныеДела</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ДниУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ЕжемесячноеПособиеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Documents/ЗаявкаСоциальноеПособиеКабинетСотрудника/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ТипЗаявки");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Шаблон = НСтр("ru = 'Сообщение %1 от %2'");
	Если Данные.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ПособиеПриРожденииРебенка Тогда
		Шаблон = НСтр("ru = 'Единовременное пособие при рождении ребенка %1 от %2'");
	ИначеЕсли Данные.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ЕжемесячноеПособиеПоУходуЗаРебенком Тогда
		Шаблон = НСтр("ru = 'Ежемесячное пособие по уходу за ребенком %1 от %2'");
	ИначеЕсли Данные.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ОтпускПоБеременностиИРодам Тогда
		Шаблон = НСтр("ru = 'Отпуск по беременности и родам %1 от %2'");
	КонецЕсли;
	Представление = СтрШаблон(Шаблон, Данные.Номер, Данные.Дата);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ИспользоватьКраткийСостав = Ложь;
	ОписаниеСостава.ЗаполнятьТабличнуюЧастьФизическиеЛицаДокумента = Ложь;
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	
	ОписаниеХранения = ЗарплатаКадрыСоставДокументов.ОписаниеХраненияСотрудниковФизическихЛиц();
	ОписаниеХранения.ПолеСотрудник      = "Сотрудник";
	ОписаниеХранения.ПолеФизическоеЛицо = "ФизическоеЛицо";
	
	ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц.Добавить(ОписаниеХранения);
	
	Возврат ОписаниеСостава;
	
	
КонецФункции

Функция ОписаниеДокументаДляЗаявки(СписокОбщихПолей) Экспорт
	
	СтрокаСвойств = "ДатаНачала,ДатаОкончания,НомерЛисткаНетрудоспособности,ДатаРожденияРебенка,ФИОРебенка";
	СписокПолей = СтрШаблон("%1,%2", СписокОбщихПолей, СтрокаСвойств);
	
	Возврат Новый Структура(СписокПолей);

КонецФункции

Функция БизнесПроцессМенеджер() Экспорт

	Возврат БизнесПроцессы.ИсполнениеЗаявкиСотрудника;

КонецФункции

Функция НаименованиеЗадачи(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ПособиеПриРожденииРебенка Тогда
		ШаблонНаименования = НСтр("ru = 'Заявление на единовременное пособие при рождении ребенка'");
	ИначеЕсли ДокументОбъект.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ЕжемесячноеПособиеПоУходуЗаРебенком Тогда
		ШаблонНаименования = НСтр("ru = 'Заявление на ежемесячное пособие по уходу за ребенком'");
	ИначеЕсли ДокументОбъект.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ОтпускПоБеременностиИРодам Тогда
		ШаблонНаименования = НСтр("ru = 'Заявление на отпуск по беременности и родам'");
	КонецЕсли;
	
	Возврат СтрШаблон("%1: %2", ШаблонНаименования, Строка(ДокументОбъект.ФизическоеЛицо));

КонецФункции

Функция СодержаниеЗадачи(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ПособиеПриРожденииРебенка Тогда
		ШаблонНаименования = НСтр("ru = 'Обработать заявление на единовременное пособие при рождении ребенка'");
	ИначеЕсли ДокументОбъект.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ПособиеПриРожденииРебенка Тогда
		ШаблонНаименования = НСтр("ru = 'Обработать заявление на ежемесячное пособие по уходу за ребенком'");
	ИначеЕсли ДокументОбъект.ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ОтпускПоБеременностиИРодам Тогда
		ШаблонНаименования = НСтр("ru = 'Обработать заявление на отпуск по беременности и родам'");
	КонецЕсли;
	
	Шаблон = НСтр("ru = '%1
	|Организация: %2
	|Сотрудник: %3'");
	
	Возврат СтрШаблон(Шаблон, ШаблонНаименования, Строка(ДокументОбъект.Организация), Строка(ДокументОбъект.Сотрудник));
	
КонецФункции

Функция РольИсполнителяЗаявки() Экспорт

	Возврат Справочники.РолиИсполнителей.ОтветственныйЗаСоциальныеПособия;

КонецФункции

#КонецОбласти

#КонецЕсли
